html/20210717175142-life_map.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-17 Sat 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Life Map</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ketan Agrawal" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
</head>
<body>
<div id="preamble" class="status">
<a style="color: inherit; text-decoration: none" href="/"><h2>Ketan's Digital Laboratory &#129514;</h2></a>
</div>
<div id="content">
<h1 class="title">Life Map</h1>
<p>
I normally don&rsquo;t like these kind of self-help guru tweets, but <a href="https://twitter.com/businessbarista/status/1415303812466814983">this</a> seems like a useful framework to get me started. Some of the timelines might need to be adjusted, but hey, <a href="20210717184432-don_t_worry_too_much_about_constants.html">don&rsquo;t worry too much about constants.</a><br />
</p>

<div id="outline-container-org8029e42" class="outline-2">
<h2 id="org8029e42">Values</h2>
<div class="outline-text-2" id="text-org8029e42">
<ul class="org-ul">
<li>Live joyfully<br /></li>
<li>Follow my curiosities deeply<br /></li>
<li>Be honest<br /></li>
<li>Be (actively) kind<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org5c3c113" class="outline-2">
<h2 id="org5c3c113">10 Year Plan (age 22 - 32)</h2>
<div class="outline-text-2" id="text-org5c3c113">
<p>
I will have a deep mastery of my field, and be extending it to new places. I will have built up a prolific body of work.<br />
I will have deep, meaningful relationships with my loved ones, friends, and colleagues.<br />
I will have inner peace, and have a 9/10 baseline happiness.<br />
</p>
</div>
</div>
<div id="outline-container-org74ebf26" class="outline-2">
<h2 id="org74ebf26">3 Year Plan (age 22 - 25)</h2>
<div class="outline-text-2" id="text-org74ebf26">
<p>
(age 22) I will graduate from Stanford with my MS.<br />
</p>

<p>
(age 23) I will start a job in industry for a year (or two) that really allows me to grow as a person.<br />
</p>

<p>
(age 24/25) I will begin a PhD prog ram with a research-active, friendly advisor whose research program fascinates me.<br />
</p>
</div>
</div>
<div id="outline-container-org897e557" class="outline-2">
<h2 id="org897e557">1 Year Plan (age 22 - 23)</h2>
<div class="outline-text-2" id="text-org897e557">
<p>
I will establish solid habits of sleep, meditation, and exercise.<br />
</p>

<p>
I will get a job offer for a job that I am happy about.<br />
</p>

<p>
I will publish a paper at a top-tier conference, where I came up with the idea, and took it through to execution.<br />
</p>

<p>
I will narrow my focus + identify potential advisors for CS PhD.<br />
I will obtain recommendations from [redacted]<br />
</p>

<p>
I will deeply read and note 10 <a href="20210717185155-books.html">books</a>, and 100 papers by the end of the school year.<br />
</p>
</div>
</div>
<div id="outline-container-org618154d" class="outline-2">
<h2 id="org618154d">90 Day Goals (age 22 - 22.25)</h2>
<div class="outline-text-2" id="text-org618154d">
<p>
I will finish [current project], and move on to a new project that will allow me to do independent research + publish.<br />
</p>

<p>
I will determine which path I want to pursue: (slow-term then PhD, job then PhD, direct to PhD)<br />
(assuming going for job) I will do interview prep for ML positions. I will start reaching out to more people in industry, as well as asking around in my current connections.<br />
</p>

<p>
I will deeply read and note 3 <a href="20210717185204-.html">books</a>. I will deeply read and note 25 papers.<br />
</p>
</div>
</div>
<div id="outline-container-org85f18b7" class="outline-2">
<h2 id="org85f18b7">Weekly Review</h2>
<div class="outline-text-2" id="text-org85f18b7">
<p>
Check in for 1 hour to see how I&rsquo;m progressing toward my 90-day goals. See if any issues have come up + address them. Modify goals if needed.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Made with <span class="heart">♥</span> using <a href="https://orgmode.org/">org-mode</a>. Source code is available <a href="https://github.com/ketan0/digital-laboratory">here</a>.</p>
</div>
</body>
</html>
